console.log(`
Общий бал = 100

1) В браузере Google Chrome при плавном изменении ширины окна от максимума до 320px включительно на странице main не появляется горизонтальная полоса прокрутки, контент не выходит за боковые границы окна

2) В браузере Google Chrome при плавном изменении ширины окна от максимума до 320px включительно на странице our pets не появляется горизонтальная полоса прокрутки, контент не выходит за боковые границы окна

3) В браузере Mozilla Firefox при плавном изменении ширины окна от максимума до 320px включительно на странице main: 1) не появляется горизонтальная полоса прокрутки, контент не выходит за боковые границы окна или 2) не появляются проблемы в верстке, отличные от тех, что были в Google Chrome. При нарушении первого пункта вычитается -10 баллов. При выполнении первого пункта и нарушении второго пункта вычитается -5 баллов за каждую уникальную ошибку, но не более -10 баллов

4) В браузере Mozilla Firefox при плавном изменении ширины окна от максимума до 320px включительно на странице our pets: 1) не появляется горизонтальная полоса прокрутки, контент не выходит за боковые границы окна или 2) не появляются проблемы в верстке, отличные от тех, что были в Google Chrome. При нарушении первого пункта вычитается -10 баллов. При выполнении первого пункта и нарушении второго пункта вычитается -5 баллов за каждую уникальную ошибку, но не более -10 баллов

5) На странице main при ширине страницы большей 1280px выполняются необходимые условия, нет нарушений отступов или размеров при проверке соответствию макету main-1280 на ширине экрана 1280px

6) На странице our pets при ширине страницы большей 1280px выполняются необходимые условия, нет нарушений отступов или размеров при проверке соответствию макету our-pets-1280 на ширине экрана 1280px

7) На странице main для ширины страницы 768px <= width < 1280px выполняются необходимые условия, нет нарушений отступов или размеров при проверке соответствию макету main-768 на ширине экрана 768px

8) На странице our pets для ширины страницы 768px <= width < 1280px выполняются необходимые условия, нет нарушений отступов или размеров при проверке соответствию макету our-pets-768 на ширине экрана 768px

9) На странице main для ширины страницы 320px <= width < 768px выполняются необходимые условия, нет нарушений отступов или размеров при проверке соответствию макету main-320 на ширине экрана 320px

10) На странице our pets для ширины страницы 320px <= width < 768px выполняются необходимые условия, нет нарушений отступов или размеров при проверке соответствию макету our-pets-320 на ширине экрана 320px

`);