console.log(`
Общий бал = 100

Отступы от границ элементов (или наборов элементов) до краев блока, по горизонтали или вертикали, отличаются более чем на 20px: 0 за каждый блок.
Отступы внутри набора или сетки между элементами, по горизонтали или вертикали, отличаются более чем на 10px: 0 за каждый блок.
Цвет фона блока или элемента отличается от дизайна (не касается положения градиента или растянутого изображения): 0 за каждый блок.
Отсутствует элемент или картинка, как фоновая, так и картинка элемента: 0 за каждый блок.
Шрифт или семейство шрифтов не подключено, или разница в размере шрифта более чем 4px: 0 за каждый блок.

Создана страница main +60.

Нет блока Header: 0.(присутствует)
Нет логотипа: 0.(присутствует)
Нет панели навигации: 0.(присутствует) Панель навигации есть, но не интерактивная: 0.(изменение курсора и цвета) Рекомендуется использовать <nav>.(присутствует)
Элемент About the shelter не подсвечен: 0.(подсвечен)
Элемент Our pets не работает как ссылка на страницу our pets: 0.(работает)
Элемент Help the shelter не работает как якорная ссылка на блок Help: 0.(работает)
Элемент Contacts не работает как якорная ссылка на блок Footer: 0.(работает)
На странице нет элемента <h1>: 0. (присутствует в Логотипе) Элемент есть, но в количестве больше одного: 0.(только 1 эл-т h1)
Фон сильно отличается от того, что на макете (не имеется ввиду смещенная картинка или градиент): 0.(не сильные отличие, увеличена зернистость)
Нет блока Not only: 0.(присутствует)
Нет кнопки Make a Friend: 0.(присутствует) Кнопка есть, но не интерактивная, или не работает как якорная ссылка на блок Our Friends: 0.(работает как ссылка, меняет цвет и курсор)
Фон сильно отличается от того, что на макете (не имеется ввиду смещенная картинка или градиент): 0.(не отличается)
Нет картинки собаки: 0.(присутствует) Картинка собаки есть, но сильно смещена, или накладывается на текст или другие блоки: 0.(не смещена)
Нет блока About: 0.(присутствует)
Нет картинки кошки и собаки: 0.(присутствует) Картинка есть, но сильно смещена, или накладывается на текст или другие блоки: 0.(не смещена)
Текст заголовка имеет неверные размеры: 0.(совпадает)
Кавычки имеют неправильный вид: 0.(совпадают)
Нет блока Our Friends: 0.(присутствует)
Нет кнопки "влево": 0.(присутствует) Кнопка есть, но не интерактивная: 0.(меняет цвет и курсор)
Нет кнопки "вправо": 0.(присутствует) Кнопка есть, но не интерактивная: 0.(меняет цвет и курсор)
Нет карточек с питомцами: 0.(присутствует) Карточки есть, но при этом:
Сеточная структура элементов нарушена: 0.(не нарушена)
Количество карточек не соотвествует макету: 0.(совпадает)
Струтура карточек нарушена (например текст или кнопка сверху над картинкой): 0.(не нарушена)
Карточки не интерактивные: 0.(!при наведениии на любое место карточки - меняет цвет кнопки, появляется курсор, меняется фон для фото питомца)
Кнопки Learn more не меняют цвет при наведении на карточку: 0.(меняет)
Нет кнопки Get to know the rest: 0.(присутствует) Кнопка есть, но не интерактивная, или не работает как ссылка на страницу our pets: 0.(работает как ссылка, меняет цвет и курсор)
Нет блока Help: 0.(присутствует)
Сеточная структура элементов нарушена (не 5 элементов сверху, 4 снизу): 0.(совпадает)
Изображение одной или более иконок отсутствуют: 0.(присутствует)
Нарушена структура (например текст сверху, иконка снизу) в одном или более элементе: 0.(не нарушена)
Нет блока In addition: 0.(присутствует)
Нет блока со ссылкой на банковский счет: 0.(присутствует). Блок есть есть, но он не интерактивный, или не является ссылкой: 0.(меняет цвет и курсор)
Нет картинки собаки: 0.(присутствует) Картинка собаки есть, но сильно смещена, или накладывается на текст или другие блоки: 0.(не отличается)
Нет блока Footer: 0.(присутствует)
Сеточная структура элементов нарушена: 0.(совпадает)
Элемент email не работает как ссылка на почтовый сервис: 0.(совпадает)
Элемент телефон не работает как ссылка на сервис звонков: 0.(совпадает)
Хотя бы один элемент локация не работает как ссылка на google maps: 0.(совпадает)
Нет картинки собаки: 0.(присутствует) Картинка собаки есть, но сильно смещена, или накладывается на текст или другие блоки: 0.(совпадает)
Фон сильно отличается от того, что на макете (не имеется ввиду смещенная картинка или градиент): 0.(не сильные отличие, увеличена зернистость)


Создана страница our pets +40.

Нет блока Header: 0.(присутствует)
Нет логотипа: 0.(присутствует) Логотип есть, но не работает как ссылка на страницу main: 0.(работает)
Нет панели навигации: 0.(присутствует) Панель навигации есть, но не интерактивная: 0.(изменение курсора и цвета) Рекомендуется использовать <nav>.(присутствует)
Элемент About the shelter не работает как ссылка на страницу main: 0.(работает)
Элемент Our pets не подсвечен: 0.(подсвечен)
Элемент Help the shelter не работает как якорная ссылка на блок Help страницы main: 0.(работает)
Элемент Contacts не работает как якорная ссылка на блок Footer: 0.(работает)
На странице нет элемента <h1>: 0.(присутствует в Логотипе) Элемент есть, но в количестве больше одного: 0.(присутствует только 1)
Фон сильно отличается от того, что на макете: 0.(не отличается)
Нет блока Our Friends: 0.(присутствует)
Нет кнопок пагинации: 0.(присутствует) Кнопка есть, но:
Кнопки одного цвета или фона: 0.(цвет слева и справа разный)
Кнопки расположены в неверной последовательности: 0.(верная последовательность)
Кнопки "влево" интерактивные: 0.(не интерактивные - т.е. не выделены цветом и-или курсором при наведении)
Кнопки "вправо" не интерактивные: 0.(интерактивные - т.е. при наведении курсора меняют цвет и курсор)
На кружочке страницы нет цифры, или там не единица: 0.(там 1)
Кружочек страницы интерактивный: 0.(не интерактивные - т.е. не выделены цветом и-или курсором при наведении)
Нет карточек с питомцами: 0.(присутствует) Карточки есть, но при этом:
Сеточная структура элементов нарушена: 0.(не нарушена)
Количество карточек не соотвествует макету: 0.(совпадает)
Струтура карточек нарушена (например текст или кнопка сверху над картинкой): 0.(не нарушена)
Карточки не интерактивные: 0.(!при наведениии на любое место карточки - меняет цвет кнопки, появляется курсор, меняется фон для фото питомца)
Кнопки Learn more не меняют цвет при наведении на карточку: 0.(меняет)
Нет блока Footer: 0.(присутствует)
Сеточная структура элементов нарушена: 0.(совпадает)
Элемент email не работает как ссылка на почтовый сервис: 0.(совпадает)
Элемент телефон не работает как ссылка на сервис звонков: 0.(совпадает)
Хотя бы один элемент локация не работает как ссылка на google maps: 0.(совпадает)
Нет картинки собаки: 0.(присутствует) Картинка собаки есть, но сильно смещена, или накладывается на текст или другие блоки: 0.(совпадает)
Фон сильно отличается от того, что на макете (не имеется ввиду смещенная картинка или градиент): 0.(не сильные отличие, увеличена зернистость)

`);